package com.baima.lgbf.enums;


public enum BaXue {
    //"申脉", "照海", "外关", "临泣", "女:内关,男:照海", "公孙", "后溪", "内关", "列缺"

    //1
    shen_mai("申脉",
            "定位\n" +
                    "外踝直下方凹陷中。\n",
            "功能作用\n" +
                    "补阳益气，疏导水湿。\n" +
                    "主治\n" +
                    "1. 头痛、眩晕；\n" +
                    "2. 癫狂痫证、失眠等神志疾患；\n" +
                    "3. 腰腿酸痛。\n",
            "临床运用\n" +
                    "现代常用于治疗踝关节扭伤、内耳眩晕、癫痫、精神分裂症等。\n"),

    //2
    zhao_hai("照海",
            "定位\n" +
                    "在踝区，内踝尖下1寸，内踝下缘边际凹陷中。\n",
            "功能作用\n" +
                    "吸热生气。\n" +
                    "主治\n" +
                    "1. 癫痫、失眠等精神、神志疾患；\n" +
                    "2. 咽干咽痛、目赤肿痛等五官热性病证；\n" +
                    "3. 小便不利，小便频数；\n" +
                    "4. 月经不调、痛经、赤白带下等妇科病证；\n" +
                    "5. 下肢痿痹。\n",
            "临床运用\n" +
                    "现代常用于治疗尿道炎、肾炎、神经衰弱、癫痫、月经不调、功能性子宫出血等。"),

    //3
    wai_guan("外关",
            "定位\n" +
                    "在前臂后区，当阳池与肘尖的连线上，腕背侧远端横纹上2寸，尺骨与桡骨间隙中点。\n",
            "功能作用\n" +
                    "联络气血，补阳益气。\n" +
                    "主治\n" +
                    "①头痛、偏头痛、颊痛、目赤肿痛、耳鸣、耳聋等头面五官疾患。\n" +
                    "②热病。\n" +
                    "③胁肋痛，上肢痹痛，肘部酸痛，手臂疼痛，肋间神经痛。\n" +
                    "④瘰疬。\n",
            "临床运用\n" +
                    "现代临床常用于治疗偏头痛、高热、神经性耳聋、肋间神经痛、落枕、急性腰扭伤等。\n"),

    //4
    lin_qi("临泣",
            "取穴\n" +
                    "位于足背外侧，当足4趾本节（第4趾关节）的后方，小趾伸肌腱的外侧凹陷处。\n" +
                    "取穴时，可采用仰卧的姿势，足临泣穴位于足背外侧，第四趾、小趾跖骨夹缝中。\n",
            "主治症状\n" +
                    "头痛，目外眦痛，目眩，乳痈，瘰疬，胁肋痛，疟疾，中风偏瘫，痹痛不仁，足跗肿痛。胆经头痛、腰痛、肌肉痉挛、眼疾、胆囊炎、中风、神经官能症等。",
            " "),

    //5
    nei_guan_zhao_hai("女:内关,男:照海",
            "", "", ""),

    //        6: 公孙
    gong_sun("公孙",
            "定位\n" +
                    "在足内侧缘，当第一跖骨基底部的前下方。\n",
            "功能作用\n" +
                    "以水湿风气的形式运化脾经之气。\n" +
                    "功效\n" +
                    "健脾益胃，通调经脉。\n" +
                    "主治\n" +
                    "1. 胃痛，呕吐，腹痛，腹泻，痢疾等脾胃肠腑病证；\n" +
                    "2. 心烦，失眠，狂证等神志病证；\n" +
                    "3. 逆气里急，气上冲心(奔豚气)等冲脉病证。\n",
            "临床运用\n" +
                    "现代常用于治疗急慢性胃炎、消化道溃疡、急慢性肠炎、神经性呕吐、消化不良、精神分裂症等。\n" +
                    "配中脘、足三里主治胃脘胀痛；\n" +
                    "配丰隆、膻中主治呕吐、眩晕。\n"),

    //7
    hou_xi("后溪",
            "定位\n" +
                    "微握拳，第5指掌关节后尺侧的远侧，掌横纹头赤白肉际处。\n",
            "功能作用\n" +
                    "强化督脉阳气。\n" +
                    "功效\n" +
                    "清心安神， 通经活络。\n" +
                    "主治\n" +
                    "1. 头项强痛、腰背痛、手指及肘臂挛痛等痛症；\n" +
                    "2. 耳聋、目赤；\n" +
                    "3. 癫狂痫；\n" +
                    "4. 疟疾。\n",
            "临床运用\n" +
                    "现代常用于治疗急性腰扭伤、落枕、耳聋、精神分裂症、癔病、角膜炎等。\n"),

    //8
    nei_guan("内关",
            "定位\n" +
                    "在前臂掌侧，当曲泽与大陵的连线上，腕横纹上2寸，掌长肌腱与桡侧腕屈肌腱之间。\n",
            "功能作用\n" +
                    "宁心安神、理气止痛。\n" +
                    "主治\n" +
                    "1. 心痛、心悸、胸闷、胸痛等心胸病证；\n" +
                    "2. 胃痛、呕吐、呃逆等胃疾；\n" +
                    "3. 失眠、癫痫等神志病证；\n" +
                    "4. 上肢痹痛、偏瘫、手指麻木等局部病证。\n",
            "临床运用\n" +
                    "现代常用于治疗心绞痛、心肌炎、心律不齐、胃炎、癔病等。\n"),

    //9
    lie_que("列缺",
            "简便定位\n" +
                    "在前臂桡侧缘，桡骨茎突上方，腕横纹上1.5寸，当肱桡肌与拇长展肌腱之间。\n" +
                    "或者以左右两手虎口交叉，一手食指押在另一手的桡骨茎突上，当食指尖到达之凹陷处取穴。\n" +
                    "或立掌或侧掌，把指向外上方翘起，先取两筋之间的阳溪穴，在阳溪穴上1.5寸的桡骨茎突中部有一凹陷即此穴。\n",
            "功能作用\n" +
                    "宣肺解表，通经活络，通调任脉 \n" +
                    "主治病证\n" +
                    "伤风外感、咳嗽、气喘、咽喉肿痛；头痛项强、口眼歪斜、齿痛；遗尿、小便热、尿血、阴茎痛；掌中热、上肢不遂、手腕无力或疼痛。\n",
            "养生保健\n" +
                    "每天坚持用食指指腹揉按列缺，每次1~3分钟，对于三叉神经痛、健忘、惊悸等病症，可以起到显著的保健调理效果。\n");
    public String name;
    public String location;
    public String features;
    public String clinical;

    BaXue(String name, String location, String features, String clinical) {
        this.name = name;
        this.location = location;
        this.features = features;
        this.clinical = clinical;
    }
}
